<script>
    export default{

    }
</script>

<template>
    <div className="PromoContainer">
        <div className="PromoContainerTop">
            <p>Picture</p>
            <div >
                <h3>Почему стоит работать
                    именно с нами?</h3>

                    <div>
                        <div>картинка</div>
                        <p>Всегда свежая обжарка</p>
                        <p>Подбор степени обжарки под каждый сорт кофе. Всегда свежая обжарка</p>
                    </div>
                    <div>
                        <div>картинка</div>
                        <p>Лучшие цены на продукции</p>
                        <p>Благодаря крупным объемам производства мы даем лучшие цены на нашу продукцию</p>
                    </div>
                    <div>
                        <div>картинка</div>
                        <p>Консультации 24/7</p>
                        <p>Наши специалисты готовы всегда помочь и подсказать вам с выбором кофе или другой продукции.</p>
                    </div>
            </div>
        </div>

        <div className='PrompContainerBot'>
            <h3>Как мы обжариваем наш кофе:</h3>
            <p>Компания Нью Рефайнинг Груп находится в г. Калининграде и имеет свой склад и представительство в Москве. Завод работает на рынке свежеобжаренного кофе и растворимой продукции более 15 лет. Завод имеет немецкое оборудование марки Probat по обжарке кофе и итальянские агломераторы для производства растворимой продукции.

                Кофе поставляется в контейнерах напрямую с плантаций по всему миру. Компания имеет долгосрочные контракты по поставке продукции. Каждая партия проходит строгий контроль на заводе для проверки зерна. Зеленое зерно обжаривается, проходит процесс дегазации и тут же отправляется клиентам. Наши обжарщики прошли обучение в России и за рубежом. У нас свой подход к каждой партии зерна.


                Мы раскрываем вкус каждого сорта кофе.</p>
            <button>Перейти в каталог</button>
        </div>
    </div>
</template>

<style>
    .PromoContainerTop{
        display: flex;
        justify-content: center;
        align-items: center;
    }
</style>