<script>
    export default{

    }
</script>

<template>
    <div className="CompanyNewsHeader">
        <h3>Новости компании</h3>
        <a>Читать все</a>
    </div>
    <div className="CompanyNewsContent">
        <div className="CompanyNewsCard">
            <div></div>
            <div>
                <h3>Танзанийский кофе. Откуда он взялся и почему мы его так любим?</h3>
                <p>Танзания – красивая африканская страна. Именно здесь расположены легендарные географические объекты – вулкан Килиманджаро и озеро Виктория.</p>
                <a>Подробнее</a>
            </div>
        </div>
        <div className="CompanyNewsCard">
            <div></div>
            <div>
                <h3>Танзанийский кофе. Откуда он взялся и почему мы его так любим?</h3>
                <p>Танзания – красивая африканская страна. Именно здесь расположены легендарные географические объекты – вулкан Килиманджаро и озеро Виктория.</p>
                <a>Подробнее</a>
            </div>
        </div>
        <div className="CompanyNewsCard">
            <div></div>
            <div>
                <h3>Танзанийский кофе. Откуда он взялся и почему мы его так любим?</h3>
                <p>Танзания – красивая африканская страна. Именно здесь расположены легендарные географические объекты – вулкан Килиманджаро и озеро Виктория.</p>
                <a>Подробнее</a>
            </div>
        </div>
        <div className="CompanyNewsCard">
            <div></div>
            <div>
                <h3>Танзанийский кофе. Откуда он взялся и почему мы его так любим?</h3>
                <p>Танзания – красивая африканская страна. Именно здесь расположены легендарные географические объекты – вулкан Килиманджаро и озеро Виктория.</p>
                <a>Подробнее</a>
            </div>
        </div>
    </div>
</template>

<style>
    .CompanyNewsHeader{
        display: flex;
        align-content: center;
        align-items: center;
        justify-content: space-between;
    }
</style>