let dataNews=[
    {header:'Танзанийский кофе. Откуда он взялся и почему мы его так любим?',
    text:'Танзания – красивая африканская страна. Именно здесь расположены легендарные географические объекты – вулкан Килиманджаро и озеро Виктория.',
    img:'../../public/img/NewsCompanyImg.png'},
    {header:'Танзанийский кофе. Откуда он взялся и почему мы его так любим?',
    text:'Танзания – красивая африканская страна. Именно здесь расположены легендарные географические объекты – вулкан Килиманджаро и озеро Виктория.',
    img:'../../public/img/NewsCompanyImg.png'},
    {header:'Танзанийский кофе. Откуда он взялся и почему мы его так любим?',
    text:'Танзания – красивая африканская страна. Именно здесь расположены легендарные географические объекты – вулкан Килиманджаро и озеро Виктория.',
    img:'../../public/img/NewsCompanyImg.png'},
    {header:'Танзанийский кофе. Откуда он взялся и почему мы его так любим?',
    text:'Танзания – красивая африканская страна. Именно здесь расположены легендарные географические объекты – вулкан Килиманджаро и озеро Виктория.'},
    {header:'Танзанийский кофе. Откуда он взялся и почему мы его так любим?',
    text:'Танзания – красивая африканская страна. Именно здесь расположены легендарные географические объекты – вулкан Килиманджаро и озеро Виктория.'},
    {header:'Танзанийский кофе. Откуда он взялся и почему мы его так любим?',
    text:'Танзания – красивая африканская страна. Именно здесь расположены легендарные географические объекты – вулкан Килиманджаро и озеро Виктория.'},
    {header:'Танзанийский кофе. Откуда он взялся и почему мы его так любим?',
    img:'../../public/img/NewsCompanyImg.png',
    text:'Танзания – красивая африканская страна. Именно здесь расположены легендарные географические объекты – вулкан Килиманджаро и озеро Виктория.'},
];

export default dataNews;